package HWork_Les_5.Core.Operations;

import java.util.ArrayList;
import HWork_Les_5.Core.Data.Base;

public class EnterBase {
    
    ArrayList<Base> allWorkers;
    
    //** Метод формирования списка сотрудников*/ 
    public static ArrayList<Base> getArrayWorkers(){
        Base worker1 = new Base(1, "Иван", "Кузнецов", "Васильевич", "20.10.1976", "Директор", "Административно-управленческий отдел", 100000, "52-60-78", "+7-911-861-54-44", "Москва", "Трудовой");
        Base worker2 = new Base(2, "Галина", "Торопышкина", "Петровна", "14.01.1990", "Главный бухгалтер", "Административно-управленческий отдел", 80000, "52-60-79", "+7-911-851-43-12", "Москва", "Трудовой");
        Base worker3 = new Base(3, "Маруся", "Кубышкина", "Халестириновна", "07.11.1967", "Менеджер по персоналу", "Административно-управленческий отдел", 50000, "52-60-80", "+7-911-821-45-22", "Москва", "Трудовой");
        Base worker4 = new Base(4, "Глеб", "Высоцкий", "Олегович", "25.05.1980", "Заместитель директора", "Административно-управленческий отдел", 60000, "52-60-81", "+7-911-831-53-32", "Москва", "Трудовой");
        Base worker5 = new Base(5, "Егор", "Топтыгин", "Федорович", "19.06.1986", "Юрист", "Административно-управленческий отдел", 40000, "52-60-79", "+7-911-851-40-12", "Москва", "Трудовой");
        Base worker6 = new Base(6, "Владислав", "Подорожников", "Петрович", "14.01.1990", "Заведующий хозяйством", "Производственный отдел", 40000, "52-60-82", "+7-911-851-43-12", "Москва", "Трудовой");
        Base worker7 = new Base(7, "Григорий", "Пушкин", "Олегович", "14.01.1991", "Системный администратор", "Производственный отдел", 25000, "52-60-82", "+7-911-851-43-12", "Москва", "ГПХ");
        Base worker8 = new Base(8, "Олег", "Топкин", "Александрович", "14.01.1990", "Водитель", "Производственный отдел", 50000, "52-60-82", "+7-911-851-43-18", "Москва", "Трудовой");
        Base worker9 = new Base(9, "Тимур", "Кукушкин", "Петрович", "14.01.1986", "Крановщик", "Производственный отдел", 90000, "52-60-82", "+7-911-851-43-19", "Москва", "Трудовой");
        Base worker10 = new Base(10, "Ольга", "Трубецкая", "Петровна", "14.01.1988", "Крановщик", "Производственный отдел", 90000, "52-60-82", "+7-911-851-43-16", "Москва", "Трудовой");
        Base worker11 = new Base(11, "Александр", "Петров", "Олегович", "14.01.1990", "Разнорабочий", "Производственный отдел", 25000, "52-60-82", "+7-911-851-43-15", "Москва", "ГПХ");
        Base worker12 = new Base(12, "Дмитрий", "Петров", "Иванович", "14.01.1988", "Разнорабочий", "Производственный отдел", 25000, "52-60-82", "+7-911-851-43-13", "Москва", "ГПХ");
        ArrayList<Base> allWorkers = new ArrayList<Base>();
        allWorkers.add(worker1);
        allWorkers.add(worker2);
        allWorkers.add(worker3);
        allWorkers.add(worker4);
        allWorkers.add(worker5);
        allWorkers.add(worker6);
        allWorkers.add(worker7);
        allWorkers.add(worker8);
        allWorkers.add(worker9);
        allWorkers.add(worker10);
        allWorkers.add(worker11);
        allWorkers.add(worker12);
        return allWorkers;
    }
}